brew "git"
brew "jq"
brew "fd"
brew "ripgrep"
brew "bat"
brew "eza"
brew "fzf"
brew "zoxide"
brew "neovim"
brew "uv"
brew "powerlevel10k"
brew "fnm"
brew "go"

cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "visual-studio-code"
cask "zed"
