aaron-bond.better-comments
anthropic.claude-code
christian-kohler.path-intellisense
clemenspeters.format-json
dbaeumer.vscode-eslint
esbenp.prettier-vscode
formulahendry.auto-rename-tag
formulahendry.code-runner
github.github-vscode-theme
golang.go
hbenl.vscode-test-explorer
humao.rest-client
irongeek.vscode-env
janisdd.vscode-edit-csv
littlefoxteam.vscode-python-test-adapter
mechatroner.rainbow-csv
mhutchie.git-graph
mikestead.dotenv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-powertoys
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vscode.test-adapter-converter
njpwerner.autodocstring
openai.chatgpt
phplasma.csv-to-table
pkief.material-icon-theme
premparihar.gotestexplorer
randomfractalsinc.vscode-data-table
redhat.vscode-yaml
shd101wyy.markdown-preview-enhanced
streetsidesoftware.code-spell-checker
tomoki1207.pdf
usernamehw.errorlens
vscode-icons-team.vscode-icons
wayou.vscode-todo-highlight
zhuangtongfa.material-theme
